<script setup>
	import {closeModal, openModal} from "jenesius-vue-modal";
</script>

<template>
	<div class="max-w-[470px] w-full p-5 bg-[#141714] rounded-[20px] flex flex-col gap-[10px]">
		<div class="flex items-center justify-between">
			<p class="text-[20px] font-bold leading-[110%]">Вывод реферальных средств</p>
			<button @click="closeModal()" class="w-9 h-9 rounded-full flex items-center justify-center bg-[#1D201D] cursor-pointer hover:opacity-80 duration-200 active:scale-95">
				<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M6.99486 7.00627C6.60433 7.3968 6.60433 8.02996 6.99486 8.42049L10.58 12.0056L6.99486 15.5908C6.60433 15.9813 6.60433 16.6145 6.99486 17.005C7.38538 17.3955 8.01855 17.3955 8.40907 17.005L11.9942 13.4198L15.5794 17.005C15.9699 17.3955 16.6031 17.3955 16.9936 17.005C17.3841 16.6145 17.3841 15.9813 16.9936 15.5908L13.4084 12.0056L16.9936 8.4205C17.3841 8.02998 17.3841 7.39681 16.9936 7.00629C16.603 6.61576 15.9699 6.61576 15.5794 7.00629L11.9942 10.5914L8.40907 7.00627C8.01855 6.61575 7.38538 6.61575 6.99486 7.00627Z" fill="#839280"/>
				</svg>
			</button>
		</div>
		<p class="text-[12px] text-[#839280]">Вы просатриваете статистику по промокоду <span class="font-bold">D7F9K2M4R8</span></p>
		<div class="flex flex-col gap-2">
			<div class="flex items-center md:px-[26px] px-[10px]">
				<div class="w-[10%] min-w-[30px] flex items-center">
					<p class="text-[#839280] text-[10px] sm:text-[12px] font-semibold leading-none">ID</p>
				</div>
				<div class="w-[45%] min-w-[70px] flex items-center justify-center">
					<p class="text-[#839280] text-[10px] sm:text-[12px] font-semibold leading-none">Промокод</p>
				</div>
				<div class="w-[45%] min-w-[70px] flex items-center justify-center">
					<p class="text-[#839280] text-[10px] sm:text-[12px] font-semibold leading-none">Активации</p>
				</div>
			</div>
			<div class="flex flex-col gap-1 max-h-[330px] overflow-auto">
				<div v-for="i in 10" class="flex items-center bg-[#1D201D] rounded-[12px] md:px-[26px] px-[10px]">
					<div class="w-[10%] min-w-[30px] min-h-[48px] flex items-center">
						<p class="text-[10px] sm:text-[12px] font-semibold leading-none">{{ i }}</p>
					</div>
					<div class="w-[45%] min-w-[70px] min-h-[48px] flex items-center justify-center">
						<p class="text-[10px] sm:text-[12px] font-semibold leading-none uppercase">Goblin_Thug</p>
					</div>
					<div class="w-[45%] min-w-[70px] min-h-[48px] flex items-center justify-center">
						<div class="flex items-center gap-1">
							<p class="text-[10px] text-[#FFB531] sm:text-[12px] font-semibold leading-none">+0.50</p>
							<svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M13.8 6.56836C13.8 10.1582 10.8899 13.0684 7.30005 13.0684C3.7102 13.0684 0.800049 10.1582 0.800049 6.56836C0.800049 2.97851 3.7102 0.0683594 7.30005 0.0683594C10.8899 0.0683594 13.8 2.97851 13.8 6.56836Z" fill="#E09B2D"/>
								<path d="M12.63 6.56836C12.63 9.51204 10.2437 11.8984 7.30005 11.8984C4.35637 11.8984 1.97005 9.51204 1.97005 6.56836C1.97005 3.62468 4.35637 1.23836 7.30005 1.23836C10.2437 1.23836 12.63 3.62468 12.63 6.56836Z" fill="#FFB531"/>
								<path fill-rule="evenodd" clip-rule="evenodd" d="M6.93853 3.5419C7.07903 3.44625 8.31402 2.6638 9.38216 3.78557C9.38216 3.78557 10.5829 4.19215 11.4172 5.92931C11.4527 6.0031 11.512 6.0819 11.59 6.16373C11.3666 7.84169 10.2841 9.25148 8.79363 9.9475C8.6345 9.52095 8.60089 9.24956 8.47489 9.01289C8.03583 8.18806 7.49011 8.12596 6.85807 8.15941C6.47549 8.17965 5.6515 8.78516 5.34011 8.77045C5.02883 8.75572 4.29394 8.31931 4.55634 8.18717C4.5846 8.1728 4.62649 8.1483 4.67517 8.11838C4.63313 7.99357 4.57959 7.78014 4.62714 7.59864C4.6292 7.5956 4.67784 7.52517 4.72819 7.60944C4.76594 7.6732 4.90228 7.83977 4.97365 7.92529C5.02157 7.89342 5.071 7.86007 5.12211 7.82505C5.08203 7.69755 5.03927 7.50167 5.08343 7.33338C5.08343 7.33338 5.1328 7.25755 5.18448 7.34448C5.21789 7.40085 5.32961 7.53857 5.40405 7.62918C5.46431 7.58646 5.52378 7.54408 5.58214 7.5021C5.54714 7.37651 5.51806 7.20654 5.55719 7.05762C5.55775 7.05677 5.607 6.9829 5.65824 7.06903C5.68699 7.11691 5.77222 7.22402 5.84288 7.31024C5.94096 7.23715 6.02655 7.17112 6.08927 7.119C6.06488 7.0055 6.05192 6.87144 6.08334 6.75133C6.08334 6.75133 6.13295 6.67595 6.1847 6.76305C6.2026 6.793 6.24346 6.84694 6.28856 6.90401C6.39725 6.7606 6.49951 6.59611 6.50189 6.49192C6.50659 6.28786 6.40618 6.07521 6.10829 5.7794C6.02336 5.69514 5.85058 5.63593 5.63329 5.61654C5.63233 5.69466 5.6331 5.76704 5.63765 5.80438C5.65123 5.91403 5.55688 5.88057 5.55688 5.88057C5.46675 5.81065 5.3968 5.71196 5.34417 5.61407C5.26242 5.61947 5.17749 5.62934 5.09123 5.64492C5.08789 5.76307 5.086 5.90075 5.0931 5.9583C5.10626 6.06626 5.01513 6.03546 5.01232 6.03449C4.90755 5.95363 4.83021 5.83311 4.7756 5.7211C4.69036 5.74244 4.60564 5.75999 4.52172 5.77477C4.51838 5.89408 4.5165 6.03444 4.5236 6.09279C4.53665 6.20065 4.44691 6.1713 4.44282 6.1699C4.32569 6.07855 4.24273 5.9388 4.18769 5.81672C4.09747 5.8237 4.0098 5.82771 3.92508 5.82844C3.91957 5.98314 3.91372 6.21863 3.92415 6.305C3.93986 6.43424 3.83191 6.39855 3.82715 6.39692C3.62589 6.24061 3.5082 5.96594 3.45258 5.80192C3.25603 5.77664 3.10062 5.73656 3.01001 5.69303C3.0108 5.68474 3.0476 5.2994 3.08174 5.17206C3.20597 4.71187 3.45472 4.34775 4.09101 4.20507C4.43605 4.12815 5.07297 4.31102 5.41497 4.15911C5.75716 4.00673 5.89408 3.56526 6.30228 3.55362C6.71036 3.5412 6.79784 3.63672 6.93853 3.5419ZM3.61445 4.64091C3.49981 4.67128 3.40949 4.97367 3.47503 5.02524C3.58712 5.11228 3.72902 4.61018 3.61445 4.64091ZM6.05589 4.09927C6.05589 4.11168 6.0571 4.12417 6.05964 4.13659C6.0811 4.2442 6.18703 4.3146 6.29605 4.29328C6.40511 4.27189 6.47612 4.16724 6.45449 4.05917C6.44603 4.01607 6.4236 3.97963 6.39336 3.95244L6.05589 4.09927Z" fill="#D69123"/>
							</svg>
						</div>
					</div>
				</div>
			</div>
			<div class="flex items-center justify-center gap-1">
				<button v-for="i in 5" class="rounded-[8px] items-center justify-center cursor-pointer active:scale-95 hover:opacity-80 duration-200 green-btn flex w-[42px] h-[42px] text-[12px] font-semibold text-[#839280] hover:text-white">{{ i }}</button>
			</div>
		</div>
	</div>
</template>

<style scoped>

</style>